Revit 2027 API
EnergyAnalysisZone.HumidificationSetPoint Property
 The humidification set point as a number between 0 and 1.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HumidificationSetPoint { get; }
Public ReadOnly Property HumidificationSetPoint As Double
	Get
public:
property double HumidificationSetPoint {
	double get ();
}
member HumidificationSetPoint : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisZone Class
Autodesk.Revit.DB.Analysis Namespace